CSI API ETABS v1
cCaseStaticNonlinearStaged.GetStageDefinitions_2 Method
 Retrieves the stage definition data for the specified load case
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetStageDefinitions_2(
	string Name,
	ref int NumberStages,
	ref double[] Duration,
	ref bool[] Output,
	ref string[] OutputName,
	ref string[] Comment
)
Function GetStageDefinitions_2 (
	Name As String,
	ByRef NumberStages As Integer,
	ByRef Duration As Double(),
	ByRef Output As Boolean(),
	ByRef OutputName As String(),
	ByRef Comment As String()
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim NumberStages As Integer
Dim Duration As Double()
Dim Output As Boolean()
Dim OutputName As String()
Dim Comment As String()
Dim returnValue As Integer
returnValue = instance.GetStageDefinitions_2(Name,
	NumberStages, Duration, Output, OutputName,
	Comment)
int GetStageDefinitions_2(
	String^ Name,
	int% NumberStages,
	array<double>^% Duration,
	array<bool>^% Output,
	array<String^>^% OutputName,
	array<String^>^% Comment
)
abstract GetStageDefinitions_2 :
        Name : string *
        NumberStages : int byref *
        Duration : float[] byref *
        Output : bool[] byref *
        OutputName : string[] byref *
        Comment : string[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing static nonlinear staged load case
NumberStages
Type: System.Int32
 The number of stages defined for the specified load case
Duration
Type: System.Double[]
 This is an array that includes the duration in days for each stage
Output
Type: System.Boolean[]
 This is an array that includes True or False, indicating if analysis output is to be saved for each stage
OutputName
Type: System.String[]
 This is an array that includes a user-specified output name for each stage
Comment
Type: System.String[]
 This is an array that includes a comment for each stage. The comment may be a blank string.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value
Remarks
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace